Repository: atareao/Picapy
Catalog: po/*.po
Languages: ta

source: File
ta: கோப்பு

source: Edit
ta: திருத்து

source: Preferences
ta: முன்னுரிமைகள்

source: Download all albums
ta: அனைத்து ஆல்பங்களை பதிவிறக்க

source: Help
ta: உதவி

source: Up
ta: மேல்

source: Add
ta: சேர்க்க

source: Remove
ta: நீக்குக

source: Download
ta: பதிவிறக்குக

source: Exit from Picapy
ta: பிகாப்பியிளிர்ந்து வெளியேற

source: Information
ta: தகவல்

source: Copy link to clipboard
ta: கிளிப்போர்டுக்கு இணைப்பை நகலெடுக்க

source: Copy thumbnail 72x72 link to clipboard
ta: கிளிப்போர்டுக்கு சிறு 72x72 இணைப்பை நகலெடுக்க

source: Copy thumbnail 144x144 link to clipboard
ta: கிளிப்போர்டுக்கு சிறு 144x144 இணைப்பை நகலெடுக்க

source: Copy thumbnail 288x288 link to clipboard
ta: கிளிப்போர்டுக்கு சிறு 288x288 இணைப்பை நகலெடுக்க

source: Copy link for web
ta: வலைத்தளத்திற்கான இணைப்பை நகலெடுக்க

source: Web...
ta: வலை ...

source: Get help online...
ta: ஆன்லைன் உதவிக்கு ...

source: Translate this application...
ta: இந்த பயன்பாட்டை மொழிபெயர்க்கவும் ...

source: Report a bug...
ta: பிழையை புகாரளி ...

source: About
ta: இதைப்பற்றி

source: Select where to download all albums
ta: அனைத்து ஆல்பங்களையும் எங்கே பதிவிறக்க என்பதை தேர்வு செய்யவும்

source: Downloading all albums...
ta: அனைத்து ஆல்பங்களையும் பதிவிறக்குகிறது ...

source: An application to manage your images in Picasa Web
ta: உங்கள் படங்களை நிர்வகிக்க ஒரு விண்ணப்பம் பிக்காசா வலையில்

source: Select where to download the album
ta: இந்த ஆல்பத்தை எங்கே பதிவிறக்க என்பதை தேர்வு செய்யவும்

source: Do you want to delete %s folders?
ta: நீங்கள் %s கோப்புறைகளை நீக்க வேண்டுமா?

source: Deleting folders...
ta: கோப்புறைகளை நீக்குகிறது ...

source: Do you want to delete this folder?
ta: உங்களுக்கு இந்த கோப்புறையை நீக்க வேண்டுமா?

source: Deleting folder...
ta: கோப்புறை நீக்குகிறது ...

source: Do you want to delete %s images?
ta: உங்களுக்கு%s படங்களை நீக்க வேண்டுமா?

source: Deleting images...
ta: படங்களை நீக்குகிறது ...

source: Do you want to delete this image?
ta: படங்களை நீக்குகிறது ...

source: Deleting image...
ta: படத்தை நீக்குகிறது ...

source: Select one or more images to upload to Picasa Web
ta: பிகாசா வலையில் பதிவேற்றம் செய்ய ஒன்று அல்லது அதற்கு மேற்பட்ட படங்களை தேர்ந்தெடுங்கள்

source: Imagenes
ta: இமகேனேஷ்

source: Edit Album
ta: ஆல்பத்தை தொகு

source: Title
ta: தலைப்பு

source: Summary
ta: சுருக்கம்

source: Access
ta: அணுகல்

source: Private
ta: தனிப்பட்ட

source: Protected
ta: பாதுகாக்கப்பட்ட

source: Public
ta: பொதுவான

source: Id
ta: அடையாளம்

source: Url
ta: இணைய முகவரி

source: Thumbnail
ta: சிறு தோற்றம்

source: Image
ta: படம்

source: Create new Album
ta: புதிய ஆல்பத்தை உருவாக்கு

source: Commentary
ta: வர்ணனை

source: Album
ta: தொகுப்பு

source: Images
ta: படங்கள்

source: Only for users
ta: பயனர்களுக்கு மட்டுமே

source: Login
ta: நுழைக

source: Image link
ta: பட இணைப்பு

source: Set image link:
ta: பட இணைப்பை அமைக்கவும்:

source: Optimization
ta: தேர்வுமுறை

source: Tags
ta: ஒட்டுகள்

source: Edit Image
ta: படத்தை திருத்தவும்
